hello_world_v2/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }

    LeftandRight
    {
        type            zeroGradient;
    }

    hot
    {
        type            fixedValue;
        value           uniform 327.75; // 56.6 degC
    }

    cold
    {
        type            fixedValue;
        value           uniform 288.15; // 15 degC
    }
    inlet
    {
        type            fixedValue;
	value 		uniform 288.15;
    }

    outlet
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
