hello_world_v2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }

    LeftandRight
    {
        type            noSlip;
    }

    hot
    {
        type            noSlip;
    }

    cold
    {
        type            noSlip;
    }
    inlet
    {
	type            fixedValue;
	value           uniform (0.1 0 0);
    }
    outlet
    {
	type		zeroGradient;
    }

}


// ************************************************************************* //
