hello_world_v2/0/k
/*--------------------------------*- C++ -*---------------:x
 * -------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    LeftandRight
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    hot
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    cold
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    
    inlet
    {
        type            fixedValue;
        value           uniform 0.375;
    }
    outlet
    {
        type            zeroGradient;
    }

    
}


// ************************************************************************* //
