hello_world_v2/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.12;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    LeftandRight
    {
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    hot
    {
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    cold
    {
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
   {
        type            zeroGradient;
    }

    

}


// ************************************************************************* //
