hello_world_v2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    LeftandRight
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       119360;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          48000;
        startFace       119760;
    }
    hot
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       167760;
    }
    cold
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       168160;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       168560;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       168600;
    }
)

// ************************************************************************* //
